Revit 2022 API
StickElementExtension Enumeration
 Presets for given Analytical Extension.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public enum StickElementExtension
Visual Basic
Public Enumeration StickElementExtension
Visual C++
public enum class StickElementExtension
Members
Member name | Description
BottomOrTop |  Bottom or Top of physical element.
ReferenceLevel |  Bottom or top Reference Level.
Plane |  Use a Plane for extension (e.g., Grid, Level).
Varies |  Extension types are different at each end.
See Also
Autodesk.Revit.DB.Structure Namespace